<template>
  <q-page class="page">
    <div class="q-pa-md flex justify-center">
      <div class="q-gutter-md flex justify-center" style="width: 700px">
        <q-timeline color="secondary">
          <q-timeline-entry heading body="История мира" />
          <q-timeline-entry title="Начало 2026">
            Мировые аномалии с закрученным пространством вызывают удивление и
            тревогу. Специалисты исследуют причины и природу явления, ищут
            способы предотвращения и решения проблемы.
          </q-timeline-entry>
          <q-timeline-entry title="Середина 2026">
            Растет число аномалий, вызывающих озабоченность у людей. Они
            отрицательно влияют на здоровье вблизи, вызывая головокружение,
            тошноту, потерю сознания и серьезные последствия, включая смерть.
            Аномалии не регистрируются электроникой и их природа пока не
            полностью понятна из-за влияния организмов.
          </q-timeline-entry>
          <q-timeline-entry title="Конец 2026">
            Появление новых аномалий растет. Города и необжитые территории
            сталкиваются с их большим количеством.
          </q-timeline-entry>
          <q-timeline-entry title="Середина 2027">
            Аномалии эволюционируют в порталы в другие миры. Некоторые люди
            рискуют идти через них, но мало кто возвращается. Возвращенцы
            находятся в ужасном состоянии, некоторые сходят с ума и просите о
            смерти, другие рассказывают о монстрах и враждебных условиях, с
            которыми столкнулись.
          </q-timeline-entry>
          <q-timeline-entry title="2028">
            Правительства отправили экспедиции с военными и учеными для изучения
            порталов и миров, в которые они ведут. Было обнаружено, что убийство
            монстров в этих мирах улучшает физические характеристики организма.
            Миры, открытые в порталах, сильно отличались: некоторые были
            маленькими и безопасными, а другие - огромными и устрашающими. При
            уничтожении живых существ в этих мирах порталы исчезали. Эти
            открытия вызвали интерес научного сообщества, но также возникли
            этические вопросы и опасения относительно последствий и
            использования порталов.
          </q-timeline-entry>
          <q-timeline-entry title="2030">
            Охотники становятся более выживаемыми и смертность снижается
            благодаря очистке миров через порталы. Они приобретают
            сверхспособности и становятся разнообразными. Однако, появляются
            монстры, выбравшиеся из порталов. Правительство активно контролирует
            порталы, особенно на окраинах городов, и беспокоится о незакрытых
            порталах на свободных территориях. Это приводит к принятию
            дополнительных мер безопасности и усилению мониторинга для защиты
            жизней людей.
          </q-timeline-entry>
          <q-timeline-entry title="Начало 2031">
            Ситуация с монстрами ухудшается, делая плавание в морях и океанах
            опасным. Множество деревень разрушено, заставляя людей бежать в
            города в поисках безопасности. Военные меняют стратегию и
            фокусируются на защите городов от монстров, прекращая активную
            очистку порталов. В связи с угрозой объявлена мобилизация, и каждый
            человек становится на защиту своего города. Ситуация критическая, и
            необходимы меры для обеспечения безопасности людей.
          </q-timeline-entry>
          <q-timeline-entry title="Конец 2031">
            Ситуация катастрофическая, множество людей погибло. Выжившие
            объединяются и создают оплоты для защиты. Они постоянно сражаются с
            монстрами и усиленно работают над защитой. С течением времени
            ситуация немного стабилизируется. Меньше порталов, сила монстров
            перестает расти. Но незакрытые порталы и монстры все еще
            представляют угрозу. Выжившие продолжают бороться, улучшая навыки и
            стратегии защиты.
          </q-timeline-entry>
          <q-timeline-entry title="2036">
            Охотники становятся более опытными и эффективными в своей работе. Их
            защита позволяет улучшить качество жизни обычных людей. Ученые
            делают открытия в области магии и исследования порталов. Выясняется,
            что порталы - это осколки разрушенных миров. Люди, убивая монстров,
            обнаруживают способность манипулировать энергией через источник в
            своей душе. Охотники получают способности монстров после их смерти,
            но количество и сила способностей ограничены силой источника. У
            охотников со множеством способностей может возникать диссонанс,
            ослабляющий их. При увеличении силы источника, диссонанс и
            негативные эффекты конфликта способностей исчезают, позволяя
            охотникам эффективно использовать свои способности без страдания и
            ослабления.
          </q-timeline-entry>
          <q-timeline-entry title="2042">
            Ученые разработали технологию контроля над порталами. Теперь можно
            выбирать осколки с нужными параметрами. Задачи с порталами требуют
            больше энергии и квалификации охотников. Также разработаны методы
            извлечения и внедрения атрибутов в охотников. Этот процесс опасен и
            требует затрат энергии и времени, но позволяет получить новые
            способности. Научные достижения открывают новые возможности для
            охотников, но требуют осторожности и подготовки для избежания рисков
            и негативных последствий.
          </q-timeline-entry>
          <q-timeline-entry title="2047">
            Почти все сферы жизни теперь контролируются охотниками, которые
            стали основными защитниками и организаторами общества. Благодаря
            новым технологиям мир сделал значительный прогресс. Человечество
            постепенно восстанавливается после значительных потерь в сражениях с
            монстрами и проблемами порталов. Исследования в области магии,
            порталов и атрибутов продолжаются. Ученые и охотники сотрудничают,
            чтобы расширить знания и разработать новые решения для выживания и
            преодоления последствий.
          </q-timeline-entry>
          <q-timeline-entry title="2055">
            Ваша история начинается с успешного завершения обучения и получения
            минимальной силы источника. Это позволило вам быть готовым к
            принятию первого атрибута. В специализированных учебных заведениях,
            которые вы посещали, вы получили необходимые знания и навыки в охоте
            на монстров и использовании атрибутов. Однако, несмотря на
            теоретическую подготовку, вы поняли, что практика играет решающую
            роль в вашеим развитии в качестве охотника.
          </q-timeline-entry>
        </q-timeline>
        <q-btn
          class="form-button shadow-2"
          style="width: 300px"
          color="primary"
          label="Перейти к созданию персонажа..."
          @click="createHero"
        />
      </div>
    </div>
  </q-page>
</template>

<script>
import { ref } from "vue";
import { Loading, Notify, Cookies } from "quasar";
import { api } from "boot/axios";
import { useRouter } from "vue-router";
import { useUserStore } from "stores/user";
import { useGlobalStore } from "stores/global";

export default {
  name: "UserRegistrationHeroPage",
  setup() {
    const $router = useRouter();
    const globalStore = useGlobalStore();
    const userStore = useUserStore();

    const createHero = function () {
      $router.push("UserRegistrationCreateHero");
    };

    return { createHero };
  },
};
</script>

<style scoped lang="sass"></style>
