<template>
  <q-page class="page">
    <div class="q-pa-md flex justify-center">
      <div class="q-gutter-md flex justify-center" style="width: 700px">
        <q-timeline color="secondary">
          <q-timeline-entry heading body="История мира" />
          <q-timeline-entry title="2026">
            Люди по всему миру оказались перед невероятными аномалиями, которые
            вызывают ассоциации с закрученным пространством. Эти явления стали
            причиной удивления и тревоги в обществе. Специалисты пытаются
            разобраться в причинах и природе этих аномалий, чтобы найти способы
            предотвращения и решения данной проблемы.
          </q-timeline-entry>
          <q-timeline-entry title="2028">
            За последнее время наблюдается небольшое увеличение числа аномалий,
            и это вызывает озабоченность среди людей. Важно отметить, что как
            люди, так и животные, находящиеся рядом с этими аномалиями, начинают
            испытывать негативные последствия для своего здоровья. В лучшем
            случае, у людей возникает головокружение, а затем появляется
            тошнота. В худшем случае, они могут потерять сознание, что может
            иметь серьезные последствия, включая смерть. Отмечается, что
            аномалии не регистрируются электронным оборудованием и ощущаются
            только жывими организамами. Это создает сложности в исследовании и
            понимании природы этих аномалий. Необходимо провести дальнейшие
            исследования, чтобы выяснить, как справиться с этой проблемой и
            обеспечить безопасность людей и животных.
          </q-timeline-entry>
          <q-timeline-entry title="2029">
            Скорость появления новых аномалий значительно возросла в последнее
            время. Большие города сталкиваются с сотнями случаев аномалий, а
            также наблюдается большое количество аномалий на необжитых
            территориях. Это вызывает серьезные опасения и требует дальнейшего
            изучения и обработки данных, чтобы понять природу и причины этих
            аномальных событий.
          </q-timeline-entry>
          <q-timeline-entry title="2030">
            Аномалии начали претерпевать изменения, приобретая сходство с
            порталами в другие миры. Некоторые отважные люди решили рискнуть и
            войти в эти порталы. Однако, почти никто из них не вернулся. Те, кто
            вернулся, находились в ужасающем состоянии: некоторые лишились
            рассудка и просили быть убитыми, другие рассказывали о жутких
            монстрах и неблагоприятных условиях, с которыми они столкнулись.
          </q-timeline-entry>
          <q-timeline-entry title="2031">
            Правительства различных стран организовали экспедиции, в которых
            участвовали военные и ученые, для исследования порталов и миров, в
            которые они ведут. Через некоторое время стало ясно, что люди,
            убившие монстров в этих мирах, получали улучшенные физические
            характеристики организма. Миры, обнаруженные в порталах, существенно
            отличались друг от друга: некоторые были небольшими и не слишком
            опасными, в то время как другие представляли собой огромные миры,
            размеры которых вызывали ужас и трепет. Когда определенное
            количество живых существ в этих мирах было уничтожено, порталы
            исчезали со временем.
          </q-timeline-entry>
          <q-timeline-entry title="2032">
            С течением времени выживаемость охотников увеличилась, а смертность
            снизилась. Работа по очистке миров стала регулярной и эффективной.
            Охотники приобрели сверхспособности, и их разнообразие впечатляло.
            Однако стали заметны монстры, выбравшиеся из порталов, что ранее не
            наблюдалось. Правительство начало усиленно контролировать порталы,
            особенно на окраинах городов. Беспокоило количество незакрытых
            порталов на свободных территориях, что вызывало ужас.
          </q-timeline-entry>
          <q-timeline-entry title="2033">
            Ситуация с монстрами продолжала ухудшаться. Плавание в морях и
            океанах стало чрезвычайно опасным, даже на прочных кораблях.
            Множество деревень были разрушены, и люди спешно бежали в города в
            поисках безопасности. Военные сменили свою стратегию и перестали
            активно зачищать порталы, а вместо этого начали защищать города от
            набегов монстров. В связи с усугублением угрозы объявлена
            мобилизация, и практически каждый второй человек встает на защиту
            своего города.
          </q-timeline-entry>
          <q-timeline-entry title="2035">
            Ситуация на планете стала катастрофической, и множество людей не
            выжило. Однако, те, кто остался в живых, стали объединяться и
            создавать прочные оплоты для защиты от монстров. Они практически не
            отдыхают, постоянно борясь с угрозой, которую представляют эти
            монстры. С течением времени ситуация стала немного
            стабилизироваться. Большее количество порталов исчезло, и сила
            монстров перестала расти. Однако, по-прежнему остаются незакрытые
            порталы и монстры, которые продолжают представлять угрозу для
            выживших людей.
          </q-timeline-entry>
          <q-timeline-entry title="2043">
            С течением времени количество и качество охотников значительно
            выросло. Они стали более опытными и эффективными в своей работе, что
            позволило отвоевывать территории у монстров. Улучшение качества
            жизни обычных людей также стало заметным, благодаря защите, которую
            оказывали охотники. Ученые сделали значительные открытия в области
            магии и исследований порталов в другие миры. Оказалось, что порталы
            представляют собой осколки разрушенных миров, не выдержавших
            подобной ситуации с порталами. Эти открытия позволили лучше понять
            природу порталов и миров, в которые они ведут. Люди, убившие
            монстров, обнаружили, что они могут создавать источник в своей душе
            и улучшать его. Источник служит хранилищем и позволяет
            манипулировать энергией. Охотники получают способности монстров
            после их смерти, которые называются атрибутами. Однако, количество и
            сила способностей ограничены силой источника. У охотников,
            обладающих разносторонними способностями, возникает диссонанс,
            который ослабляет их и вызывает страдание от вражды энергий
            конфликтующих способностей. Однако, с увеличением силы источника
            негативные эффекты исчезают, и охотники могут более эффективно
            использовать свои способности.
          </q-timeline-entry>
          <q-timeline-entry title="2052">
            Ученые смогли разработать технологию контроля над созданием и
            удержанием порталов после их зачистки. Теперь возможно как открыть
            портал в случайный осколок, так и специально выбрать осколок с
            определенными параметрами. Однако, чем сложнее и требовательнее
            задача, тем больше энергии и квалификации охотников требуется для
            успешной работы с порталами. Ученые также смогли разработать методы
            извлечения или внедрения атрибутов в охотников. Этот процесс
            является опасным, болезненным и требует значительных затрат энергии
            и времени. Однако, он позволяет охотникам получать новые
            способности, усиливая их возможности в борьбе с монстрами. Такие
            научные достижения открывают новые перспективы для охотников и
            позволяют им эффективнее справляться с угрозой монстров. Однако,
            использование этих технологий требует осторожности и подготовки,
            чтобы избежать потенциальных рисков и негативных последствий.
          </q-timeline-entry>
          <q-timeline-entry title="2053">
            Практически все сферы жизни теперь контролируются охотниками,
            которые стали основными защитниками и организаторами общества.
            Благодаря найденным и разработанным технологиям, мир сделал
            значительный шаг в будущее. Новые открытия и достижения позволили
            человечеству выжить и начать восстановление. Однако, несмотря на
            прогресс, недостатка в людях все еще ощущается из-за значительных
            потерь в опасные времена. Человечество постепенно развивается,
            стремится к изучению всего, что может помочь в выживании и
            преодолении последствий монстров и порталов. Исследования в области
            магии, порталов и атрибутов продолжаются, а ученые и охотники
            работают вместе, чтобы расширить свои знания и разработать новые
            технологии. Человечество стремится к восстановлению и развитию,
            чтобы обеспечить безопасность и процветание для всех выживших.
          </q-timeline-entry>
          <q-timeline-entry title="2055">
            Моя история начинается с того, что я закончил обучение в 20 лет.
            Получив минимальную силу источника, я стал готов к принятию первого
            атрибута. Это было возможно благодаря специализированным учебным
            заведениям, где я получил необходимые знания и навыки. В течение
            обучения я изучал различные аспекты охоты на монстров и
            использования атрибутов. Учебные заведения предоставляли мне
            возможность практиковаться и улучшать свои навыки под руководством
            опытных охотников. Получение первого атрибута было значимым моментом
            в моей жизни. Этот атрибут дал мне новые возможности и способности,
            которые я мог использовать в борьбе с монстрами и защите людей. Он
            стал основой для дальнейшего развития моих сил и умений.
          </q-timeline-entry>
        </q-timeline>
        <q-btn
          class="form-button shadow-2"
          style="width: 300px"
          color="primary"
          label="Перейти к созданию персонажа..."
          @click="createHero"
        />
      </div>
    </div>
  </q-page>
</template>

<style scoped lang="sass"></style>

<script>
// TODO: Сделать страницу предистории
import { ref } from "vue";
import { Loading, Notify, Cookies } from "quasar";
import { api } from "boot/axios";
import { useRouter } from "vue-router";
import { useUserStore } from "stores/user";
import { useGlobalStore } from "stores/global";

export default {
  name: "UserRegistrationHeroPage",
  setup() {
    const globalStore = useGlobalStore();
    const userStore = useUserStore();

    return {};
  },
};
</script>
