<template>
  <q-page class="page">
    <div class="q-pa-md flex justify-center">
      <div class="q-gutter-md flex justify-center" style="width: 700px">
        <q-timeline color="secondary">
          <q-timeline-entry heading body="История мира" />
          <q-timeline-entry title="2026">
            Люди по всему миру оказались перед невероятными аномалиями, которые
            вызывают ассоциации с закрученным пространством. Эти явления стали
            причиной удивления и тревоги в обществе. Специалисты пытаются
            разобраться в причинах и природе этих аномалий, чтобы найти способы
            предотвращения и решения данной проблемы.
          </q-timeline-entry>
          <q-timeline-entry title="2028">
            За последнее время наблюдается небольшое увеличение числа аномалий,
            и это вызывает озабоченность среди людей. Важно отметить, что как
            люди, так и животные, находящиеся рядом с этими аномалиями, начинают
            испытывать негативные последствия для своего здоровья. В лучшем
            случае, у людей возникает головокружение, а затем появляется
            тошнота. В худшем случае, они могут потерять сознание, что может
            иметь серьезные последствия, включая смерть. Отмечается, что
            аномалии не регистрируются электронным оборудованием и ощущаются
            только жывими организамами. Это создает сложности в исследовании и
            понимании природы этих аномалий.
          </q-timeline-entry>
          <q-timeline-entry title="2029">
            Скорость появления новых аномалий значительно возросла в последнее
            время. Большие города сталкиваются с сотнями случаев аномалий, а
            также наблюдается большое количество аномалий на необжитых
            территориях.
          </q-timeline-entry>
          <q-timeline-entry title="2030">
            Аномалии продолжают эволюционировать, приобретая черты порталов в
            другие миры. Несмотря на риск, некоторые отважные люди решают войти
            в эти порталы. Однако, почти никто из них не возвращается. Те, кто
            все же вернулся, оказываются в ужасающем состоянии: некоторые
            лишаются рассудка и просят о смерти, другие рассказывают о страшных
            монстрах и враждебных условиях, с которыми они столкнулись.
          </q-timeline-entry>
          <q-timeline-entry title="2031">
            Правительства различных стран организовали экспедиции, в которых
            участвовали военные и ученые, с целью исследования порталов и миров,
            в которые они ведут. По мере проведения исследований стало очевидно,
            что люди, убившие монстров в этих мирах, получали значительное
            улучшение физических характеристик своего организма. Открытые миры в
            порталах существенно отличались друг от друга: некоторые были
            маленькими и относительно безопасными, в то время как другие
            представляли собой огромные и устрашающие миры, размеры которых
            вызывали трепет и ужас. При достижении определенного количества
            уничтоженных живых существ в этих мирах, порталы постепенно
            исчезали. Эти новые открытия создали новые возможности и вызвали
            интерес научного сообщества, однако, также возникли этические
            вопросы и опасения относительно последствий исследования и
            использования таких порталов.
          </q-timeline-entry>
          <q-timeline-entry title="2032">
            С течением времени выживаемость охотников значительно возросла, а
            смертность снизилась благодаря эффективной и регулярной работе по
            очистке миров через порталы. Охотники приобрели сверхспособности, и
            их разнообразие стало впечатляющим. Однако стали появляться монстры,
            которые выбирались из порталов, что ранее не наблюдалось. В ответ на
            это правительство начало активно контролировать порталы, особенно на
            окраинах городов. Особую тревогу вызывало количество незакрытых
            порталов на свободных территориях, что вызывало ужас и опасения. Это
            создавало необходимость в дополнительных мерах безопасности и более
            тщательном мониторинге, чтобы предотвратить вторжение монстров и
            защитить жизни людей.
          </q-timeline-entry>
          <q-timeline-entry title="2033">
            Ситуация с монстрами продолжает ухудшаться, и плавание в морях и
            океанах становится крайне опасным, даже на прочных кораблях.
            Множество деревень подверглись разрушению, и люди спешно бежали в
            города в поисках безопасности. Военные меняют свою стратегию и
            перестают активно очищать порталы, сосредотачиваясь на защите
            городов от набегов монстров. В связи с нарастающей угрозой
            объявляется мобилизация, и практически каждый второй человек встает
            на защиту своего города. Ситуация становится критической, и важно
            принять все необходимые меры для защиты людей и обеспечения их
            безопасности.
          </q-timeline-entry>
          <q-timeline-entry title="2035">
            Ситуация на планете стала катастрофической, и множество людей
            погибло. Однако, выжившие люди начали объединяться и создавать
            прочные оплоты для защиты от монстров. Они практически не отдыхают,
            постоянно сражаясь с угрозой, которую представляют эти монстры. С
            течением времени ситуация немного стабилизировалась. Большее
            количество порталов исчезло, и сила монстров перестала расти.
            Однако, все еще остаются незакрытые порталы и монстры, которые
            продолжают представлять угрозу для выживших людей. Выжившие
            продолжают бороться, улучшая свои навыки и разрабатывая стратегии
            для защиты от угрозы.
          </q-timeline-entry>
          <q-timeline-entry title="2043">
            С течением времени количество и качество охотников значительно
            выросло. Они стали более опытными и эффективными в своей работе, что
            позволило им отвоевывать территории у монстров. Улучшение качества
            жизни обычных людей стало заметным благодаря защите, которую
            оказывали охотники. Ученые сделали значительные открытия в области
            магии и исследований порталов в другие миры. Оказалось, что порталы
            представляют собой осколки разрушенных миров, не выдержавших
            подобной ситуации с порталами. Эти открытия позволили лучше понять
            природу порталов и миров, в которые они ведут. Люди, убившие
            монстров, обнаружили, что они могут создавать источник в своей душе
            и улучшать его. Источник служит хранилищем и позволяет
            манипулировать энергией. Охотники получают способности монстров
            после их смерти, которые называются атрибутами. Однако, количество и
            сила способностей ограничены силой источника. У охотников,
            обладающих разносторонними способностями, может возникать диссонанс,
            который ослабляет их и вызывает страдание от вражды энергий
            конфликтующих способностей. С увеличением силы источника, негативные
            эффекты и диссонанс, вызываемые конфликтом способностей у охотников,
            начинают исчезать. Это позволяет охотникам более эффективно
            использовать свои способности без страдания и ослабления.
          </q-timeline-entry>
          <q-timeline-entry title="2052">
            Ученые действительно смогли разработать технологию контроля над
            созданием и удержанием порталов после их зачистки. Теперь стало
            возможным как открыть портал в случайный осколок, так и специально
            выбрать осколок с определенными параметрами. Однако, более сложные и
            требовательные задачи требуют больше энергии и квалификации
            охотников для успешной работы с порталами. Ученые также разработали
            методы извлечения или внедрения атрибутов в охотников. Этот процесс
            является опасным, болезненным и требует значительных затрат энергии
            и времени. Однако, он позволяет охотникам получать новые способности
            и усиливать свои возможности в борьбе с монстрами. Такие научные
            достижения открывают новые перспективы для охотников и позволяют им
            эффективнее справляться с угрозой монстров. Однако, необходима
            осторожность и подготовка при использовании этих технологий, чтобы
            избежать потенциальных рисков и негативных последствий.
          </q-timeline-entry>
          <q-timeline-entry title="2053">
            Практически все сферы жизни теперь контролируются охотниками,
            которые стали основными защитниками и организаторами общества.
            Благодаря найденным и разработанным технологиям, мир сделал
            значительный шаг в будущее. Новые открытия и достижения позволили
            человечеству выжить и начать восстановление. Однако, несмотря на
            прогресс, недостатка в людях все еще ощущается из-за значительных
            потерь в опасные времена. Человечество постепенно развивается,
            стремится к изучению всего, что может помочь в выживании и
            преодолении последствий монстров и порталов. Исследования в области
            магии, порталов и атрибутов продолжаются, а ученые и охотники
            работают вместе, чтобы расширить свои знания и разработать новые
            технологии.
          </q-timeline-entry>
          <q-timeline-entry title="2055">
            Ваша история начинается с успешного завершения обучения и получения
            минимальной силы источника. Это позволило вам быть готовым к
            принятию первого атрибута. В специализированных учебных заведениях,
            которые вы посещали, вы получил необходимые знания и навыки в охоте
            на монстров и использовании атрибутов. Однако, несмотря на
            теоретическую подготовку, вы поняли, что практика играет решающую
            роль в вашеим развитии в качестве охотника.
          </q-timeline-entry>
        </q-timeline>
        <q-btn
          class="form-button shadow-2"
          style="width: 300px"
          color="primary"
          label="Перейти к созданию персонажа..."
          @click="createHero"
        />
      </div>
    </div>
  </q-page>
</template>

<style scoped lang="sass"></style>

<script>
// TODO: Сделать страницу предистории
import { ref } from "vue";
import { Loading, Notify, Cookies } from "quasar";
import { api } from "boot/axios";
import { useRouter } from "vue-router";
import { useUserStore } from "stores/user";
import { useGlobalStore } from "stores/global";

export default {
  name: "UserRegistrationHeroPage",
  setup() {
    const globalStore = useGlobalStore();
    const userStore = useUserStore();

    return {};
  },
};
</script>
