{
  "data": [
    {
      "name": "Начало?",
      "text": "Некоторый слой бытия. Здесь правят законы и их отсутствие, истина и ложь, свет и тьма. Это бесконечная группа миров, где смерть физической оболочки освобождает душу, направляя её на следующую ступень развития, где абстрактное пространство складывается из кусков различных реальностей, возникающих при встрече с сущностями. Чем больше существ собирается в одной точке, тем быстрее мир вокруг них развивается и расширяется."
    },
    {
      "name": "Посмертие",
      "text": "Одна из душ, освободившись от тела, прибыла на этот слой, но разрыв связи ослабил ее до предела. В темной заброшенной комнате она ощущала, как что-то невидимое, но неподвластное, начинает медленно сгущаться вокруг нее."
    },
    {
      "name": "Становление",
      "text": "Душа, пронизанная тонкими волнами этой энергии, начинает плавно скользить по комнате, исследуя каждый уголок. Иногда другие души, более насыщенные энергией, мелькали мимо, украдкой отнимая у нее кусочки силы, но чаще всего это было наоборот. В какой-то момент яркий сгусток энергии начал вибрировать, и пыль вокруг него стала стремительно сгущаться, словно притягиваемая невидимой силой."
    },
    {
      "name": "Рост",
      "text": "Со временем зловещая сила, притягивающая все более крупные объекты, начинает усиливаться, словно водоворот, поглощающий все на своем пути. Внезапно, сгусток, окруженный различными материями, вспыхивает ярким светом, словно портал в мир иной. Изнутри этого светового портала вырывается существо, похожее на человека, но иссушенное и изможденное. Оно ощущает странную жажду, неведомую и необъяснимую, и, кряхтя от слабости, поднимается и отправляется исследовать мир вокруг."
    },
    {
      "name": "Движение",
      "text": "Пройдя через дверной проем, существо замечает другое существо, схожее с ним, но исполненное агрессии и злобы. На мгновение они замирают, взгляды их встречаются, и зловещий рык разрывает тишину, взывая к битве за души и судьбы, затянутые в этот мистический водоворот. Однако, неожиданно, оно споткнулось о старую доску и рухнуло на пол. Жадное существо незамедлительно набросилось на него, начав пожирать безжизненное тело. Противник был безмолвен и неподвижен, не в силах встать или повернуться. С каждым укусом его сила угасала. По мере того как существо пожирало, его тело становилось все более крепким, а в груди разгорался непонятный огонек, приносящий приятное тепло и утоляющий голод. По окончанию этого мрачного пиршества, жажда отступила. Существо присело у стены, замирая в размышлениях, где мелькали непонятные и мистические образы."
    },
    {
      "name": "Осознание",
      "text": "В момент попыток захватить образы, озарение осенило существо. Ярко и ясно всплыли в памяти его прошлые жизни, но это состояние смятения не продлилось долго. Внезапно все воспоминания исчезли, оставив лишь характер и общую информацию в новом разуме. В этот момент существо осознало себя и огляделось вокруг. Взглянув в окно, оно увидело заброшенные многоэтажные дома, полуразрушенные заводы и магазины. Улица на первый взгляд казалась пустой, но почувствовалось, что это далеко не так. Существа, не осознавшие свою сущность, больше не привлекали внимание, так же как их не привлекало существо, осознавшее себя."
    },
    {
      "name": "Выбор",
      "text": "Вы чувствовали, что этот мир - всего лишь следующая ступень вашего духовного пути. Но сколько же еще подобных ступенек предстоит вам пройти? Будете ли вы стремиться подняться на следующую ступеньку или остановитесь, чтобы стать опорой для других? Решение принадлежит вам."
    }
  ]
}
