{
  "data": [
    {
      "name": "Начало?",
      "text": "Бытие существовало всегда. Бытие это всё и ничего, правила и их отсуствие, правда и ложь, добро и зло."
    },
    {
      "name": "Бесконечно позднее",
      "text": "Та группа бесконечного количества миров, в которой души после смерти отправляются на другой слой бытия."
    },
    {
      "name": "Бездна",
      "text": "Обстрактно бесконечное пространство состоящее из кусков различных реальностей создающихся при контакте с существами. Чем больше в одной точке скопится существ и тем более сильных, то окружающий мир будет быстрее развиваться и расширяться."
    },
    {
      "name": "Ещё более бесконечно позднее",
      "text": "Ваша душа после смерти прибыла на данный слой. После разрыва связи с телом душа очень сильно ослабла. И в данный момент она находится в непонятной заброшенной комнате."
    },
    {
      "name": "Инициация",
      "text": "Небольшой комочек энергии постепенно становится более плотным."
    },
    {
      "name": "Движение",
      "text": "Душа после получения небольшого количества рассеяной энергии начинает передвигаться и исследовать окружающее пространство."
    },
    {
      "name": "Поглощение",
      "text": "Иногда мимо души проплывают другие души более насыщенные энергией забирая всполоски энергии, но чаще происходило наоборот."
    },
    {
      "name": "Кульминация",
      "text": "В один определённый момент уже яркий сгусток энергии начинает вибрировать. Окружающая сгусток пыль начинает притягиваться к нему. Со временем засасывающая сила увеличивается притягивая объекты крупнее."
    },
    {
      "name": "Рождение",
      "text": "Сгусток со всех сторон облепленный различной материй резко впыхивает. На месте сгустка на полу появляется существо напоминающее человека. Оно выглядит очень слабым и иссущённым. Существо чувствует непонятную жажду которая заставляет его кряхтя встать и идти исследовать окружающее пространство."
    },
    {
      "name": "Исследование",
      "text": "Выйдя и комнаты существо в пределах несколких метров заметило существо себе подобное, которое на мгновение замерло и резко зарычав кинулось в его сторону. Но сделав шаг оно споткнулось об лежащую доску и растянулось на полу. Первое существо не задумываюсь под эфектом жажды навалилось на него сверху и начало его пожирать. Противник не мог ни встать, ни повернутся. С каждым укусом он всё сильнее слабел. Поедая, тело становилось крепче и в груди появлялось чувство как будто разгорается небольшой огонёк дарующий приятное тепло и ослабляющий голод."
    },
    {
      "name": "Восстановление",
      "text": "По окончанию пиршества жажда отступила. Присев у стены существо замерло погружаясь в мысли в которых мелькли непонятные образы."
    },
    {
      "name": "Перерождение",
      "text": "Попытки ухватиться за образы привели к озарению. Существо ярко вспоминает свою прошлую жизнь. Смятение не продлилось долго. Резко все воспоминания исчезли оставив в новом разуме только характер и общую информацию."
    },
    {
      "name": "Осознание",
      "text": "Вы осознали себя. И посмотря по сторонам, выглянув в окно увидев заброшенные полуразрушенные многоэтажные дома, заводы, магазины. Улица на первый взгляд пустынна, но пришло понимание, что это далеко не так. Окружающие существа неосознавшие себя вас уже не интересовали, как и вы их."
    },
    {
      "name": "Выбор",
      "text": "Вы чётко понимали что этот мир стал следующей ступенька пути вашей души. И неизвестно сколько таких ступенек у вас будет. Пойти по пути взбирания на ступеньку повыше или же становления ступенькой для других. Каков ваш выбор?"
    },
    {
      "name": "",
      "text": "Это начало вашей истории..."
    }
  ]
}
